## seaborn 의 dataframe (csv.file)을 불러와서 
## 오늘 배운 내용 적용해보기~

### 1. 'mpg' data로 연습문제 만들어서 진행함.
---

In [2]:
import pandas as pd
import seaborn as sns

In [5]:
df = sns.load_dataset('mpg')

In [6]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [7]:
# horsepower가 100 이상이면서, origin이 usa가 아닌 결과를 
# model_year의 오름차순 정렬로, name과 함께 상위 10개로 출력해줘요~

In [70]:
cond1 = df['horsepower'] >= 100
cond2 = df['origin'] != 'usa'

# new_data = df.loc[cond1 & cond2].sort_values('model_year', ascending=True).head(10)[['model_year', 'name']]
# new_data
df.loc[cond1 & cond2].sort_values('model_year', ascending=True).head(10)[['model_year', 'name']]
# new_df[['model_year', 'name']]

     model_year                name
23           70            bmw 2002
76           72     volvo 145e (sw)
120          73         volvo 144ea
122          73           saab 99le
123          73      toyota mark ii
180          75           saab 99le
207          76           volvo 245
210          76      toyota mark ii
211          76  mercedes-benz 280s
242          77            bmw 320i

In [37]:
#위의 결과값에서, name (차종)이 같을 경우, 가장 최근에 출시된 차만 보고 싶다면? 
latest_models = new_df.loc[new_df.groupby('name')['model_year'].idxmax()]
latest_models[['model_year', 'name']]

     model_year                name
23           70            bmw 2002
242          77            bmw 320i
211          76  mercedes-benz 280s
180          75           saab 99le
210          76      toyota mark ii
120          73         volvo 144ea
76           72     volvo 145e (sw)
207          76           volvo 245

In [39]:
# 결측값이 있는지?

In [40]:
df_copy = df.copy()

In [54]:
df_copy.isnull().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

In [57]:
#결측치가 발견된 horsepower의 값을 평균값으로 채워주자. 
mean_horsepower = df_copy['horsepower'].mean()
df_copy['horsepower'] = df_copy['horsepower'].fillna(mean_horsepower)
df_copy['horsepower']

0      130.0
1      165.0
2      150.0
3      150.0
4      140.0
       ...
393     86.0
394     52.0
395     84.0
396     79.0
397     82.0
Name: horsepower, Length: 398, dtype: float64

In [58]:
# origin 이 japan인 차의 weight가 낮은순 정렬
df_copy = df.copy()

In [61]:
cond = df_copy['origin'] == 'japan'
# df_copy.loc[cond].sort_values('weight', ascending=True).head(20)

df_copy.loc[cond].sort_values('weight', ascending=True).head(20)[['name', 'model_year', 'weight']]

                      name  model_year  weight
54             datsun 1200          71    1613
144          toyota corona          74    1649
343         toyota starlet          81    1755
345       honda civic 1300          81    1760
53     toyota corolla 1200          71    1773
181       honda civic cvcc          75    1795
198            honda civic          76    1795
248       honda civic cvcc          78    1800
131    toyota corolla 1200          74    1836
329    honda civic 1500 gl          80    1850
220  datsun f-10 hatchback          77    1945
129            datsun b210          74    1950
383            honda civic          82    1965
384     honda civic (auto)          82    1965
310  toyota corolla tercel          80    1968
377       mazda glc custom          82    1970
294       maxda glc deluxe          79    1975
347         datsun 210 mpg          81    1975
349            mazda glc 4          81    1985
239              subaru dl          77    1985

### 2. 'penguins' data로 연습문제 만들어서 진행함.
---

In [71]:
import pandas as pd
import seaborn as sns

In [72]:
df = sns.load_dataset('penguins')

In [74]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [80]:
# 5000g 이상의 펭귄 출력
cond1 = df['body_mass_g'] >= 5000.0
df.loc[cond1].head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
221,Gentoo,Biscoe,50.0,16.3,230.0,5700.0,Male
223,Gentoo,Biscoe,50.0,15.2,218.0,5700.0,Male
224,Gentoo,Biscoe,47.6,14.5,215.0,5400.0,Male
227,Gentoo,Biscoe,46.7,15.3,219.0,5200.0,Male
229,Gentoo,Biscoe,46.8,15.4,215.0,5150.0,Male

In [82]:
# Gentoo종의 flilpper_length 평균
cond2 = df['species'] == 'Gentoo'
df.loc[cond2, 'flipper_length_mm'].mean()

np.float64(217.1869918699187)

In [84]:
# Female Chinstrap 종의 bill_length 높은순 정렬
cond3 = df['sex'] == 'Female'
cond4 = df['species'] == 'Chinstrap'


df.loc[cond3 & cond4].sort_values('bill_length_mm', ascending=False).head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
169,Chinstrap,Dream,58.0,17.8,181.0,3700.0,Female
196,Chinstrap,Dream,50.9,17.9,196.0,3675.0,Female
178,Chinstrap,Dream,50.5,18.4,200.0,3400.0,Female
219,Chinstrap,Dream,50.2,18.7,198.0,3775.0,Female
198,Chinstrap,Dream,50.1,17.9,190.0,3400.0,Female

In [78]:
# species (종) 별 성별 구분하여 평균 몸무게 출력
# e.g. Adelia, Female / Adelie, male/ Gentoo, Female ... etc.

In [89]:
cond5 = df['species'] == 'Adelie'
cond6 = df['sex'] == 'Female'
df.loc[cond5 & cond6, 'body_mass_g'].mean()

np.float64(3368.8356164383563)

In [90]:
# 성진님 코드에서 복붙~
# species(종)별 성별 구분하여 평균 몸무게 출력
# => ex) Adelie, Female / Adelie, male / Gentoo, Female...

df_copy = df.copy()
for species in df_copy['species'].unique(): # df_copy['species'].unique()는 ['Adelie' 'Chinstrap' 'Gentoo'] 나오기 때문에 for문을 써서 종별 구분/ unique를 붙여야 'list' 형식으로 출력된다. 
    for sex in df_copy['sex'].unique()[:2]: # df_copy['sex'].unique()는 ['Male' 'Female' nan] 나오기 때문에 for문을 쓰지만 nan을 쓰지 않고 Female까지만 나올 수 있도록 [:2]를 써서 성별 구분
        con1 = df_copy['species'] == species
        con2 = df_copy['sex'] == sex
        print(f'{species}, {sex}의 평균 몸무게는 ', end = '')
        print(df_copy.loc[con1 & con2, 'body_mass_g'].mean()) # 평균 몸무게 출력

Adelie, Male의 평균 몸무게는 4043.4931506849316
Adelie, Female의 평균 몸무게는 3368.8356164383563
Chinstrap, Male의 평균 몸무게는 3938.970588235294
Chinstrap, Female의 평균 몸무게는 3527.205882352941
Gentoo, Male의 평균 몸무게는 5484.836065573771
Gentoo, Female의 평균 몸무게는 4679.741379310345

In [91]:
#결측값을 미리 제거하고 species(종)별 성별 구분하여 평균 몸무게 출력해본다면?
df_copy = df.copy()